avr-rust/avrd/packs/atmega/ATmega324PB.atdf
        <module name="JTAG">
          <instance name="JTAG" caption="JTAG Interface">
            <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data" caption="JTAG Interface"/>
            <signals>
              <signal group="TCK" function="default" pad="PC2"/>
              <signal group="TMS" function="default" pad="PC3"/>
              <signal group="TDO" function="default" pad="PC4"/>
              <signal group="TDI" function="default" pad="PC5"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="PCINT" index="0" function="default" pad="PA0"/>
              <signal group="PCINT" index="1" function="default" pad="PA1"/>
              <signal group="PCINT" index="2" function="default" pad="PA2"/>
              <signal group="PCINT" index="3" function="default" pad="PA3"/>
              <signal group="PCINT" index="4" function="default" pad="PA4"/>
              <signal group="PCINT" index="5" function="default" pad="PA5"/>
              <signal group="PCINT" index="6" function="default" pad="PA6"/>
              <signal group="PCINT" index="7" function="default" pad="PA7"/>
              <signal group="PCINT" index="8" function="default" pad="PB0"/>
              <signal group="PCINT" index="9" function="default" pad="PB1"/>
              <signal group="PCINT" index="10" function="default" pad="PB2"/>
              <signal group="PCINT" index="11" function="default" pad="PB3"/>
              <signal group="PCINT" index="12" function="default" pad="PB4"/>
              <signal group="PCINT" index="13" function="default" pad="PB5"/>
              <signal group="PCINT" index="14" function="default" pad="PB6"/>
              <signal group="PCINT" index="15" function="default" pad="PB7"/>
              <signal group="PCINT" index="16" function="default" pad="PC0"/>
              <signal group="PCINT" index="17" function="default" pad="PC1"/>
              <signal group="PCINT" index="18" function="default" pad="PC2"/>
              <signal group="PCINT" index="19" function="default" pad="PC3"/>
              <signal group="PCINT" index="20" function="default" pad="PC4"/>
              <signal group="PCINT" index="21" function="default" pad="PC5"/>
              <signal group="PCINT" index="22" function="default" pad="PC6"/>
              <signal group="PCINT" index="23" function="default" pad="PC7"/>
              <signal group="PCINT" index="24" function="default" pad="PD0"/>
              <signal group="PCINT" index="25" function="default" pad="PD1"/>
              <signal group="PCINT" index="26" function="default" pad="PD2"/>
              <signal group="PCINT" index="27" function="default" pad="PD3"/>
              <signal group="PCINT" index="28" function="default" pad="PD4"/>
              <signal group="PCINT" index="29" function="default" pad="PD5"/>
              <signal group="PCINT" index="30" function="default" pad="PD6"/>
              <signal group="PCINT" index="31" function="default" pad="PD7"/>
              <signal group="PCINT" index="32" function="default" pad="PE0"/>
              <signal group="PCINT" index="33" function="default" pad="PE1"/>
              <signal group="INT" index="0" function="default" pad="PD2"/>
              <signal group="INT" index="1" function="default" pad="PD3"/>
              <signal group="INT" index="2" function="default" pad="PB2"/>
           </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC0" function="default" pad="PA0"/>
              <signal group="ADC1" function="default" pad="PA1"/>
              <signal group="ADC2" function="default" pad="PA2"/>
              <signal group="ADC3" function="default" pad="PA3"/>
              <signal group="ADC4" function="default" pad="PA4"/>
              <signal group="ADC5" function="default" pad="PA5"/>
              <signal group="ADC6" function="default" pad="PA6"/>
              <signal group="ADC7" function="default" pad="PA7"/>
            </signals>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
          </instance>
        </module>
        <module name="SPI">
          <instance name="SPI0" caption="Serial Peripheral Interface">
            <register-group name="SPI0" name-in-module="SPI0" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
            <signals>
              <signal group="SS" function="default" pad="PB4"/>
              <signal group="MOSI" function="default" pad="PB5"/>
              <signal group="MISO" function="default" pad="PB6"/>
              <signal group="SCK" function="default" pad="PB7"/>
            </signals>
          </instance>
          <instance name="SPI1" caption="Serial Peripheral Interface">
            <register-group name="SPI1" name-in-module="SPI1" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
            <signals>
              <signal group="SS" function="default" pad="PD6"/>
              <signal group="SCK" function="default" pad="PD7"/>
              <signal group="MISO" function="default" pad="PE2"/>
              <signal group="MOSI" function="default" pad="PE3"/>
            </signals>
          </instance>
        </module>
        <module name="TWI">
          <instance name="TWI0" caption="Two Wire Serial Interface">
            <register-group name="TWI0" name-in-module="TWI0" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
            <signals>
              <signal group="SDA0" function="default" pad="PC0"/>
              <signal group="SCL0" function="default" pad="PC1"/>
            </signals>
          </instance>
          <instance name="TWI1" caption="Two Wire Serial Interface">
            <register-group name="TWI1" name-in-module="TWI1" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
            <signals>
              <signal group="SDA1" function="default" pad="PE5"/>
              <signal group="SCL1" function="default" pad="PE6"/>
            </signals>
          </instance>
        </module>
